//---------------------------------------------------------------------------------------------------------
// КОД ЗАПРОСА
//---------------------------------------------------------------------------------------------------------

// URL ссылка.
var url = `https://api-admachina.affise.com/3.0/stats/conversions`

    //##-------------------------------------------------
    /*Дополнительные условия запроса URL*/ + "?"

    //Api-ключ                                                   
    + "&" + `API-Key=` + `8c7dbc24215a9fe8f09979edcde633b0`

    //Стример
    + "&" + `subid2=` + `pinkscreen`

    //Офер
    + "&" + `offer=` + `3659`

    //Дата
    + "&" + `date_from=` + `2023-01-01`
    + "&" + `date_to=` + `2048-03-09`

    //Доп.данные
    + "&" + `limit=` + `1`
    + "&" + `device=` + `desktop`
    ;
//##-------------------------------------------------
//## Если условий нет, то закомментируйте этот кусок кода


// CERC - Console Element Request Cycle
function CERC() // Функция отправки GET запроса JSON
{
    // переменная нового "XMLHttpRequest" запроса
    var xhr = new XMLHttpRequest();

    /* Пояснение:
    XMLHttpRequest – это встроенный в браузер объект, 
    который даёт возможность делать HTTP-запросы к серверу
    без перезагрузки страницы. 
    */

    //Метод потключения
    xhr.open("GET", url, true);

    //Вполнение функции при успешном подключение
    xhr.onload = function () {
        if (xhr.readyState === 4 && xhr.status === 200 /*проверка статуса запроса */) {

            const api_out = JSON.parse(xhr.responseText);             // результат страницы в переменную методом JSON.

            //------------------------------------------
            // Консоль
            // console.clear();                                        // очистка консоли от предыдущих резултатов
            console.log(api_out);                                   // вывод в консоль результата

            //------------------------------------------
            // Элементы консоли в переменные
            const total_count = api_out.pagination.total_count;
            // Примеры для прописывания новых переменных из элементов:
            // var НАЗВАНИЕ_ЭЛЕМЕНТА = api_out.ЭЛЕМЕНТ
            // var НАЗВАНИЕ_ЭЛЕМЕНТА = api_out.ДЕРИКТОРИЯ.ЭЛЕМЕНТ



            //------------------------------------------
            // // [Тест] результат в консоль и на страницу в виде обычного текста
            var out = (xhr.responseText);
            document.getElementById("console").innerHTML = out;
            

            //==========================================
            //ВЫВОД В HTML
            //==========================================
            
            document.getElementById("total_count").innerHTML = total_count; //ВЫВОД GET ЗАПРОСА

            /* 
            Примеры для Отображение переменных:
                - Стандартное (РЕКОМЕНДУЕМОЕ)
                    document.getElementById("НАЗВАНИЕ_ЭЛЕМЕНТА").innerHTML = НАЗВАНИЕ_ЭЛЕМЕНТА;
                - Особые (Если уверены что ничего не сломаеться.)
                    document.getElementById("НАЗВАНИЕ_ЭЛЕМЕНТА").innerHTML = api_out.ЭЛЕМЕНТ;
                    document.getElementById("НАЗВАНИЕ_ЭЛЕМЕНТА").innerHTML = api_out.ДЕРИКТОРИЯ.ЭЛЕМЕНТ;
                    document.getElementById("ДРУГОЕ_НАИМЕНОВАИЕ").innerHTML = НАЗВАНИЕ_ЭЛЕМЕНТА;

            Для этого надо заранее продумать какие элементы как и где должны будут отображены на странице.
            по стандарту рекомендуеться в элементы прописывать надпись "NULL"
            Пример [для HTML]: <p id="переменная">NULL</p>
            */
           
            //==========================================
        }
    };
    xhr.send(); // Отсылка запроса обратно
};

//---------------------------------------------------------------------------------------------------------
// КОД "PROGRESS BAR"
//---------------------------------------------------------------------------------------------------------

function progress_bar() //Настройки бара 
{
    var max_quantity = 50;    // Максимальное значение

    var basis_PB_width = 350; // Ширина бара (В пикселях)
    var basis_PB_height = 58; // Высота бара (В пикселях)

    //basis_PB - basis of the progress bar (основа индикатора выполнения)
    let basis_PB = document.querySelector('#basis_PB');
    basis_PB.ariaValueMax = max_quantity;
    basis_PB.style.width = basis_PB_width + 'px';
    basis_PB.style.height = basis_PB_height + 'px';

    //fill_PB - filling the progress bar (заполнение индикатора выполнения)
    let fill_PB = document.querySelector('#fill_PB');

    let progress = num_total_count / max_quantity;    
    
    fill_PB.style.width = progress + '%';

    //==========================================
    //ВЫВОД В HTML
    //==========================================
    document.getElementById("max_quantity").innerHTML = max_quantity;
    document.getElementById("progress").innerHTML = progress;
    //==========================================

};

//---------------------------------------------------------------------------------------------------------
// КОД ТАЙМЕРА
//---------------------------------------------------------------------------------------------------------

// Таймер
var time = 10000; // 300000 мс (Стандартный ~5 минут) - интервал времени между запросами

// Функция запуска таймера на запроса
function reloading() {
    setInterval(function () {
        CERC(); /*Console Element Request Cycle*/
        progress_bar();
    }, time);
};

